Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# dialog.saveWorkspaceLayout.commandTooLongMessage
source: One or more captured commands are longer than %lld UTF-8 bytes and cannot be replayed reliably from a saved layout. Shorten them before saving.
ar: أمر أو أكثر من الأوامر الملتقطة أطول من %lld بايت بتنسيق UTF-8 ولا يمكن إعادة تشغيلها بشكل موثوق من مخطط محفوظ. قم بتقصيرها قبل الحفظ.
bs: Jedna ili više snimljenih komandi duže su od %lld UTF-8 bajtova i ne mogu se pouzdano ponovo pokrenuti iz spremljenog rasporeda. Skratite ih prije spremanja.
da: En eller flere registrerede kommandoer er længere end %lld UTF-8-byte og kan ikke afspilles pålideligt fra et gemt layout. Gør dem kortere, før du gemmer.
de: Ein oder mehrere erfasste Befehle sind länger als %lld UTF-8-Bytes und können nicht zuverlässig aus einem gespeicherten Layout wiedergegeben werden. Kürzen Sie sie vor dem Speichern.
es: Uno o más comandos capturados superan los %lld bytes UTF-8 y no se pueden reproducir de forma fiable desde un diseño guardado. Acórtalos antes de guardar.
fr: Une ou plusieurs commandes capturées dépassent %lld octets UTF-8 et ne peuvent pas être rejouées de manière fiable à partir d'une disposition enregistrée. Raccourcissez-les avant de l'enregistrer.
it: Uno o più comandi acquisiti superano %lld byte UTF-8 e non possono essere rieseguiti in modo affidabile da un layout salvato. Accorciali prima di salvare.
ja: キャプチャされた1つ以上のコマンドが%lld UTF-8バイトを超えているため、保存されたレイアウトから確実に再実行することができません。保存する前に短縮してください。
ko: 캡처된 하나 이상의 명령어가 %lld UTF-8 바이트보다 길어서 저장된 레이아웃에서 안정적으로 다시 실행할 수 없습니다. 저장하기 전에 길이를 줄여 주세요.
nb: Én eller flere fangede kommandoer er lengre enn %lld UTF-8-byte og kan ikke kjøres på nytt pålitelig fra et lagret oppsett. Forkort dem før du lagrer.
pl: Jedno lub więcej przechwyconych poleceń ma więcej niż %lld bajtów UTF-8 i nie można ich niezawodnie odtworzyć z zapisanego układu. Skróć je przed zapisaniem.
pt_br: Um ou mais comandos capturados têm mais de %lld bytes UTF-8 e não podem ser reexecutados de forma confiável a partir de um layout salvo. Encurte-os antes de salvar.
ru: Одна или несколько захваченных команд длиннее %lld байт UTF-8 и не могут надежно запускаться из сохраненного макета. Сократите их перед сохранением.
th: คำสั่งที่จับไว้หนึ่งรายการขึ้นไปยาวเกิน %lld ไบต์ UTF-8 และไม่สามารถเรียกใช้ซ้ำจากเลย์เอาต์ที่บันทึกไว้ได้อย่างน่าเชื่อถือ โปรดย่อให้สั้นลงก่อนบันทึก
tr: Yakalanan komutlardan biri veya daha fazlası %lld UTF-8 bayttan uzun ve kaydedilmiş bir düzenden güvenilir şekilde yeniden çalıştırılamaz. Kaydetmeden önce kısaltın.
uk: Одна або кілька захоплених команд довші за %lld байтів UTF-8 і не можуть надійно запускатися зі збереженого макета. Скоротіть їх перед збереженням.
zh_hans: 捕获的一个或多个命令长度超过了 %lld 个 UTF-8 字节，无法从保存的布局中可靠地重放。请在保存前将其缩短。
zh_hant: 一個或多個擷取到的指令長度超過 %lld 個 UTF-8 位元組，因此無法從儲存的版面配置中可靠地重新執行。請在儲存前將其縮短。

# dialog.saveWorkspaceLayout.commandTooLongTitle
source: Command Too Long to Save
ar: الأمر طويل جدًا للحفظ
bs: Komanda je preduga za spremanje
da: Kommandoen er for lang til at gemme
de: Befehl ist zu lang zum Speichern
es: El comando es demasiado largo para guardarlo
fr: Commande trop longue à enregistrer
it: Comando troppo lungo da salvare
ja: コマンドが長すぎて保存できません
ko: 명령이 너무 길어 저장할 수 없음
nb: Kommandoen er for lang til å lagres
pl: Polecenie jest zbyt długie do zapisania
pt_br: Comando longo demais para salvar
ru: Команда слишком длинная для сохранения
th: คำสั่งยาวเกินกว่าจะบันทึก
tr: Komut kaydetmek için çok uzun
uk: Команда задовга для збереження
zh_hans: 命令太长，无法保存
zh_hant: 指令太長，無法儲存

# dialog.saveWorkspaceLayout.commandsHeader
source: Commands that will be saved and re-run:
ar: الأوامر التي سيتم حفظها وإعادة تشغيلها:
de: Befehle, die gespeichert und erneut ausgeführt werden:
es: Comandos que se guardarán y se volverán a ejecutar:
fr: Commandes qui seront enregistrées et réexécutées :
ja: 保存され再実行されるコマンド:
ko: 저장되고 다시 실행될 명령어 목록:
zh_hans: 将保存并重新运行的命令：
zh_hant: 將會儲存並重新執行的指令：

# dialog.saveWorkspaceLayout.defaultName
source: Workspace
ar: مساحة العمل
de: Arbeitsbereich
es: Espacio de trabajo
fr: Espace de travail
ja: ワークスペース
ko: 작업 공간
zh_hans: 工作区
zh_hant: 工作區

# dialog.saveWorkspaceLayout.envHeader
source: Environment variables whose values will be saved:
ar: متغيرات البيئة التي سيتم حفظ قيمها:
de: Umgebungsvariablen, deren Werte gespeichert werden:
es: Variables de entorno cuyos valores se guardarán:
fr: Variables d’environnement dont les valeurs seront enregistrées :
ja: 値が保存される環境変数:
ko: 값이 저장될 환경 변수 목록:
zh_hans: 将保存其值的环境变量：
zh_hant: 將會儲存其值的環境變數：

# dialog.saveWorkspaceLayout.failedTitle
source: Couldn't Save Workspace Layout
ar: تعذر حفظ مخطط مساحة العمل
de: Arbeitsbereich-Layout konnte nicht gespeichert werden
es: No se pudo guardar el diseño del espacio de trabajo
fr: Impossible d’enregistrer la disposition de l’espace de travail
ja: ワークスペースレイアウトを保存できませんでした
ko: 작업 공간 레이아웃을 저장할 수 없음
zh_hans: 无法保存工作区布局
zh_hant: 無法儲存工作區配置

# dialog.saveWorkspaceLayout.makeDefaultCheckbox
source: Use as default for new workspaces
ar: استخدام كافتراضي لمساحات العمل الجديدة
de: Als Standard für neue Arbeitsbereiche verwenden
es: Usar como predeterminado para nuevos espacios de trabajo
fr: Utiliser comme disposition par défaut pour les nouveaux espaces de travail
ja: 新規ワークスペースのデフォルトとして使用
ko: 새 작업 공간의 기본값으로 사용
zh_hans: 用作新工作区的默认布局
zh_hant: 做為新工作區的預設值

# dialog.saveWorkspaceLayout.message
source: Saves this workspace as a reusable layout in %@. It appears in the new-workspace menu and the Command Palette.
ar: يحفظ مساحة العمل هذه كمخطط قابل لإعادة الاستخدام في %@. سيظهر في قائمة مساحة العمل الجديدة ولوحة الأوامر Command Palette.
de: Speichert diesen Arbeitsbereich als wiederverwendbares Layout in %@. Es erscheint im Menü für neue Arbeitsbereiche und in der Befehlspalette.
es: Guarda este espacio de trabajo como un diseño reutilizable en %@. Aparecerá en el menú de nuevo espacio de trabajo y en la paleta de comandos.
fr: Enregistre cet espace de travail en tant qu'agencement réutilisable dans %@. Il apparaît dans le menu de nouvel espace de travail et dans la Palette de commandes.
ja: このワークスペースを再利用可能なレイアウトとして %@ に保存します。新規ワークスペースメニューとコマンドパレットに表示されます。
ko: 이 작업 공간을 %@에 재사용 가능한 레이아웃으로 저장합니다. 저장된 레이아웃은 새 작업 공간 메뉴와 커맨드 팔레트에 표시됩니다.
zh_hans: 将此工作区保存为可重用的布局，存放在 %@。它会出现在新建工作区菜单和命令面板中。
zh_hant: 將此工作區儲存為 %@ 中的可重複使用配置。它將會顯示在「新工作區」選單和命令面板中。

# dialog.saveWorkspaceLayout.namePlaceholder
source: Layout name
ar: اسم المخطط
es: Nombre del diseño
fr: Nom de la disposition
ja: レイアウト名
ko: 레이아웃 이름
zh_hans: 布局名称
zh_hant: 配置名稱

# dialog.saveWorkspaceLayout.ok
source: OK
ar: موافق
es: Aceptar
fr: D'ACCORD
ko: 확인
zh_hans: 确定
zh_hant: 確定

# dialog.saveWorkspaceLayout.save
source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
zh_hans: 保存
zh_hant: 儲存

# dialog.saveWorkspaceLayout.skippedNote
source: %lld panels have no layout representation (previews, viewers, …) and will be left out.
ar: لا تملك %lld لوحة أي تمثيل تخطيطي (المعاينات، وأدوات العرض، …) وسيتم استبعادها.
de: %lld Panels haben keine Layoutdarstellung (Vorschauen, Viewer, …) und werden ausgelassen.
es: %lld paneles no tienen representación de diseño (vistas previas, visores, …) y se omitirán.
fr: %lld panneaux n'ont pas de représentation de disposition (aperçus, visionneuses, …) et seront exclus.
ja: %lld個のパネルにはレイアウト表現（プレビュー、ビューアーなど）がないため、除外されます。
ko: %lld개의 패널은 레이아웃 표현(미리보기, 뷰어, …)이 없으므로 제외됩니다.
zh_hans: %lld 个面板没有布局表示（预览、查看器……），将被排除。
zh_hant: 有 %lld 個面板沒有版面配置表示形式（預覽、檢視器…），將不予包含。

# dialog.saveWorkspaceLayout.title
source: Save Workspace Layout
ar: حفظ مخطط مساحة العمل
de: Arbeitsbereich-Layout speichern
es: Guardar diseño del espacio de trabajo
fr: Enregistrer la disposition de l’espace de travail
ja: ワークスペースレイアウトを保存
ko: 작업 공간 레이아웃 저장
zh_hans: 保存工作区布局
zh_hant: 儲存工作區配置

# dialog.saveWorkspaceLayout.urlsHeader
source: URLs that will be saved:
ar: عناوين URL التي سيتم حفظها:
de: URLs, die gespeichert werden:
es: URLs que se guardarán:
fr: URL qui seront enregistrées :
ja: 保存される URL:
ko: 저장될 URL 목록:
zh_hans: 将保存的 URL：
zh_hant: 將會儲存的 URL：

# dialog.savedLayout.error.blankName
source: Enter a name before saving the layout.
ar: أدخل اسمًا قبل حفظ المخطط.
de: Geben Sie einen Namen ein, bevor Sie das Layout speichern.
es: Introduce un nombre antes de guardar el diseño.
fr: Saisissez un nom avant d’enregistrer la disposition.
ja: レイアウトを保存する前に名前を入力してください。
ko: 레이아웃을 저장하기 전에 이름을 입력하세요.
zh_hans: 保存布局前请输入名称。
zh_hant: 儲存配置前請先輸入名稱。

# dialog.savedLayout.error.corruptFile
source: The saved layouts file could not be read. Check it and try again.
ar: تعذر قراءة ملف المخططات المحفوظة. تحقق منه وحاول مرة أخرى.
de: Die Datei mit den gespeicherten Layouts konnte nicht gelesen werden. Überprüfen Sie sie und versuchen Sie es erneut.
es: No se pudo leer el archivo de diseños guardados. Verifícalo e inténtalo de nuevo.
fr: Le fichier des dispositions enregistrées n’a pas pu être lu. Vérifiez-le et réessayez.
ja: 保存済みレイアウトファイルを読み取れませんでした。内容を確認してから再試行してください。
ko: 저장된 레이아웃 파일을 읽을 수 없습니다. 파일을 확인하고 다시 시도하세요.
zh_hans: 无法读取已保存的布局文件。请检查后重试。
zh_hant: 無法讀取已儲存的配置檔案。請檢查該檔案並重試。

# dialog.savedLayout.error.duplicateName
source: A layout with that name already exists.
ar: مخطط بهذا الاسم موجود بالفعل.
de: Ein Layout mit diesem Namen existiert bereits.
es: Ya existe un diseño con ese nombre.
fr: Une disposition portant ce nom existe déjà.
ja: その名前のレイアウトはすでに存在します。
ko: 같은 이름의 레이아웃이 이미 존재합니다.
zh_hans: 已存在同名布局。
zh_hant: 已存在相同名稱的配置。

# dialog.savedLayout.error.notFound
source: That saved layout could not be found.
ar: تعذر العثور على هذا المخطط المحفوظ.
de: Das gespeicherte Layout konnte nicht gefunden werden.
es: No se pudo encontrar ese diseño guardado.
fr: Cette disposition enregistrée n’a pas pu être trouvée.
ja: その保存済みレイアウトが見つかりませんでした。
ko: 저장된 레이아웃을 찾을 수 없습니다.
zh_hans: 找不到该已保存的布局。
zh_hant: 找不到該已儲存的配置。

# dialog.savedLayout.error.title
source: Layout Not Saved
ar: لم يتم حفظ المخطط
de: Layout nicht gespeichert
es: Diseño no guardado
fr: Disposition non enregistrée
ja: レイアウトは保存されませんでした
ko: 레이아웃이 저장되지 않음
zh_hans: 布局未保存
zh_hant: 配置未儲存

# dialog.savedLayout.error.unknown
source: The saved layout request could not be completed. Try again.
ar: تعذر إكمال طلب المخطط المحفوظ. حاول مرة أخرى.
de: Die Anforderung für das gespeicherte Layout konnte nicht abgeschlossen werden. Versuchen Sie es erneut.
es: No se pudo completar la solicitud de diseño guardado. Inténtalo de nuevo.
fr: La demande de disposition enregistrée n’a pas pu être complétée. Réessayez.
ja: 保存済みレイアウトの要求を完了できませんでした。再試行してください。
ko: 저장된 레이아웃 요청을 완료할 수 없습니다. 다시 시도하세요.
zh_hans: 无法完成已保存布局的请求。请重试。
zh_hant: 無法完成已儲存配置的要求。請重試。

# dialog.savedLayout.overwrite.confirm
source: Replace
ar: استبدال
de: Ersetzen
es: Reemplazar
fr: Remplacer
ja: 置き換え
ko: 대체
zh_hans: 替换
zh_hant: 取代

# dialog.savedLayout.overwrite.message
source: A layout named “%@” already exists. Replace it?
ar: يوجد مخطط باسم “%@” بالفعل. هل تريد استبداله؟
de: Ein Layout namens „%@“ existiert bereits. Ersetzen?
es: Ya existe un diseño llamado “%@”. ¿Quieres reemplazarlo?
fr: Un agencement nommé “%@” existe déjà. Le remplacer ?
ja: “%@” という名前のレイアウトはすでに存在します。置き換えますか？
ko: 이름이 “%@”인 레이아웃이 이미 존재합니다. 대체하시겠습니까?
zh_hans: 名为“%@”的布局已存在。要替换它吗？
zh_hant: 已存在名為「%@」的配置。要取代它嗎？

# dialog.savedLayout.overwrite.title
source: Replace Saved Layout?
ar: استبدال المخطط المحفوظ؟
de: Gespeichertes Layout ersetzen?
es: ¿Reemplazar diseño guardado?
fr: Remplacer la disposition enregistrée ?
ja: 保存済みレイアウトを置き換えますか？
ko: 저장된 레이아웃을 대체하시겠습니까?
zh_hans: 替换已保存的布局？
zh_hant: 要取代已儲存的配置嗎？

# dialog.savedLayout.save.confirm
source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
zh_hans: 保存
zh_hant: 儲存

# dialog.savedLayout.save.message
source: Enter a name for this workspace layout.
ar: أدخل اسمًا لمخطط مساحة العمل هذا.
de: Geben Sie einen Namen für dieses Arbeitsbereich-Layout ein.
es: Introduce un nombre para este diseño de espacio de trabajo.
fr: Saisissez un nom pour cette disposition d’espace de travail.
ja: このワークスペースレイアウトの名前を入力してください。
ko: 이 작업 공간 레이아웃의 이름을 입력하세요.
zh_hans: 为此工作区布局输入一个名称。
zh_hant: 請輸入此工作區配置的名稱。

# dialog.savedLayout.save.placeholder
source: Layout name
ar: اسم المخطط
es: Nombre del diseño
fr: Nom de la disposition
ja: レイアウト名
ko: 레이아웃 이름
zh_hans: 布局名称
zh_hant: 配置名稱

# dialog.savedLayout.save.title
source: Save Layout as Template
ar: حفظ المخطط كقالب
de: Layout als Vorlage speichern
es: Guardar diseño como plantilla
fr: Enregistrer la disposition comme modèle
ja: レイアウトをテンプレートとして保存
ko: 레이아웃을 템플릿으로 저장
zh_hans: 将布局保存为模板
zh_hant: 將配置儲存為範本

# dialog.simulatorCameraCleanupFailed.message
source: cmux stayed open because it could not restore a Simulator app’s camera state. Quit again to retry cleanup.
ar: ظل برنامج cmux مفتوحًا لأنه لم يتمكن من استعادة حالة الكاميرا لتطبيق Simulator. قم بالإنهاء مرة أخرى لإعادة محاولة التنظيف.
de: cmux blieb geöffnet, da der Kamerastatus einer Simulator-App nicht wiederhergestellt werden konnte. Erneut beenden, um die Bereinigung zu versuchen.
es: cmux permaneció abierto porque no pudo restaurar el estado de la cámara de una aplicación de Simulator. Sal de nuevo para volver a intentar la limpieza.
fr: cmux est resté ouvert car il n’a pas pu restaurer l’état de l’appareil photo d’une application Simulator. Quittez à nouveau pour réessayer le nettoyage.
ja: Simulator アプリのカメラ状態を復元できなかったため、cmux は終了しませんでした。もう一度終了してクリーンアップを再試行してください。
ko: Simulator 앱의 카메라 상태를 복원할 수 없어 cmux가 열려 있습니다. 정리를 다시 시도하려면 다시 종료하세요.
zh_hans: cmux 仍保持打开，因为它无法恢复某个模拟器应用的相机状态。请再次退出以重试清理。
zh_hant: cmux 保持開啟狀態，因為無法還原 Simulator 應用程式的相機狀態。請再次結束以重試清理。

# dialog.simulatorCameraCleanupFailed.title
source: Couldn’t Finish Simulator Cleanup
ar: تعذر إنهاء تنظيف Simulator
de: Simulator-Bereinigung konnte nicht abgeschlossen werden
es: No se pudo completar la limpieza del Simulador
fr: Impossible de terminer le nettoyage du Simulator
ja: Simulator のクリーンアップを完了できませんでした
ko: Simulator 정리를 완료할 수 없음
zh_hans: 无法完成模拟器清理
zh_hant: 無法完成 Simulator 清理

# dialog.sshURL.blocked.ok
source: OK
ar: موافق
es: Aceptar
fr: D'ACCORD
ko: 확인
zh_hans: 确定
zh_hant: 確定

# dialog.sshURL.blocked.title
source: cmux SSH Link Blocked
ar: تم حظر رابط SSH لـ cmux
de: cmux-SSH-Link blockiert
es: Enlace SSH de cmux bloqueado
fr: Lien SSH cmux bloqué
ja: cmux SSH リンクをブロックしました
ko: cmux SSH 링크 차단됨
zh_hans: cmux SSH 链接已被阻止
zh_hant: cmux SSH 連結已封鎖

# dialog.sshURL.cancel
source: No
ar: لا
de: NEIN
fr: Non
ja: いいえ
ko: 아니요
zh_hans: 否
zh_hant: 不

# dialog.sshURL.checkbox
source: I trust this SSH target and want cmux to connect.
ar: أنا أثق في هدف SSH هذا وأريد أن يتصل cmux.
de: Ich vertraue diesem SSH-Ziel und möchte, dass cmux eine Verbindung herstellt.
es: Confío en este destino SSH y quiero que cmux se conecte.
fr: Je fais confiance à cette cible SSH et je souhaite que cmux s’y connecte.
ja: この SSH 接続先を信頼し、cmux で接続することに同意します。
ko: 이 SSH 대상을 신뢰하며 cmux가 연결하도록 허용합니다.
zh_hans: 我信任此 SSH 目标，希望 cmux 进行连接。
zh_hant: 我信任此 SSH 目標，並允許 cmux 進行連線。

# dialog.sshURL.commandLabel
source: Command preview:
ar: معاينة الأمر:
de: Befehlsvorschau:
es: Vista previa del comando:
fr: Aperçu de la commande :
ja: コマンドのプレビュー:
ko: 명령어 미리보기:
zh_hans: 命令预览：
zh_hant: 指令預覽：

# dialog.sshURL.error.conflictingDestinationParameters
source: The link included conflicting SSH target fields.
ar: تضمن الرابط حقول هدف SSH متعارضة.
de: Der Link enthielt widersprüchliche SSH-Zielfelder.
es: El enlace incluía campos de destino SSH en conflicto.
fr: Le lien contenait des champs de cible SSH conflictuels.
ja: リンクに競合する SSH 接続先フィールドが含まれています。
ko: 링크에 충돌하는 SSH 대상 필드가 포함되어 있습니다.
zh_hans: 该链接包含相互冲突的 SSH 目标字段。
zh_hant: 該連結包含衝突的 SSH 目標欄位。

# dialog.sshURL.error.conflictingTitleParameters
source: The link included both title and name. Use only one workspace title field.
ar: تضمن الرابط كلاً من العنوان والاسم. استخدم حقل عنوان مساحة عمل واحد فقط.
de: Der Link enthielt sowohl einen Titel als auch einen Namen. Verwenden Sie nur ein Titel-Feld für den Arbeitsbereich.
es: El enlace incluía tanto el título como el nombre. Usa solo un campo de título de espacio de trabajo.
fr: Le lien contenait à la fois un titre et un nom. Utilisez un seul champ de titre d’espace de travail.
ja: リンクに title と name の両方が含まれています。ワークスペース名のフィールドは 1 つだけ使用してください。
ko: 링크에 제목과 이름이 모두 포함되어 있습니다. 작업 공간 제목 필드는 하나만 사용하세요.
zh_hans: 该链接同时包含 title 和 name。只能使用一个工作区标题字段。
zh_hant: 該連結同時包含了標題和名稱。請僅使用一個工作區標題欄位。

# dialog.sshURL.error.destinationContainsUnsafeCharacters
source: The SSH host or user contains unsupported or hidden characters, so cmux refused to use it.
ar: يحتوي مضيف أو مستخدم SSH على أحرف غير مدعومة أو مخفية، لذا رفض cmux استخدامه.
de: Der SSH-Host oder -Benutzer enthält nicht unterstützte oder versteckte Zeichen, weshalb cmux die Verwendung verweigert hat.
es: El usuario o host SSH contiene caracteres ocultos o no admitidos, por lo que cmux se negó a usarlo.
fr: L’hôte ou l’utilisateur SSH contient des caractères non pris en charge ou masqués, cmux a donc refusé de l’utiliser.
ja: SSH ホストまたはユーザーに未対応の文字または隠れた文字が含まれているため、cmux は使用を拒否しました。
ko: SSH 호스트 또는 사용자에 지원되지 않거나 숨겨진 문자가 포함되어 있어 cmux가 연결을 거부했습니다.
zh_hans: SSH 主机或用户名包含不支持或隐藏的字符，因此 cmux 拒绝使用。
zh_hant: SSH 主機或使用者包含不受支援或隱藏的字元，因此 cmux 拒絕使用。

# dialog.sshURL.error.destinationStartsWithDash
source: The SSH host or user cannot start with a dash.
ar: لا يمكن أن يبدأ مضيف أو مستخدم SSH بشرطة.
de: Der SSH-Host oder -Benutzer darf nicht mit einem Bindestrich beginnen.
es: El usuario o host SSH no puede comenzar con un guion.
fr: L’hôte ou l’utilisateur SSH ne peut pas commencer par un tiret.
ja: SSH ホストまたはユーザーをダッシュで始めることはできません。
ko: SSH 호스트 또는 사용자는 대시(-)로 시작할 수 없습니다.
zh_hans: SSH 主机或用户名不能以短横线开头。
zh_hant: SSH 主機或使用者不能以減號開頭。

# dialog.sshURL.error.destinationTooLong
source: The SSH target is too long. The maximum length is %lld characters.
ar: وجهة SSH طويلة جدًا. الحد الأقصى للطول هو %lld حرف.
de: Das SSH-Ziel ist zu lang. Die maximale Länge beträgt %lld Zeichen.
es: El destino SSH es demasiado largo. La longitud máxima es de %lld caracteres.
fr: La cible SSH est trop longue. La longueur maximale est de %lld caractères.
ja: SSHの接続先が長すぎます。最大長は%lld文字です。
ko: SSH 대상이 너무 깁니다. 최대 길이는 %lld자입니다.
zh_hans: SSH 目标过长。最大长度为 %lld 个字符。
zh_hant: SSH 目標過長。最大長度為 %lld 個字元。

# dialog.sshURL.error.duplicateParameter
source: The SSH link repeated a parameter: %@
ar: كرر رابط SSH معلمة: %@
de: Der SSH-Link hat einen Parameter wiederholt: %@
es: El enlace SSH repetía un parámetro: %@
fr: Le lien SSH a répété un paramètre : %@
ja: SSH リンクで同じパラメータが繰り返されています: %@
ko: SSH 링크에 매개변수가 중복되었습니다: %@
zh_hans: 该 SSH 链接重复了一个参数：%@
zh_hant: SSH 連結重複了參數：%@

# dialog.sshURL.error.invalidBooleanParameter
source: The SSH link included an invalid boolean value for parameter: %@
ar: تضمن رابط SSH قيمة منطقية غير صالحة للمعلمة: %@
de: Der SSH-Link enthielt einen ungültigen booleschen Wert für den Parameter: %@
es: El enlace SSH incluía un valor booleano no válido para el parámetro: %@
fr: Le lien SSH contient une valeur booléenne non valide pour le paramètre : %@
ja: SSH リンクのパラメータに無効な真偽値が含まれています: %@
ko: SSH 링크에 매개변수 %@에 대한 잘못된 부울(boolean) 값이 포함되어 있습니다.
zh_hans: 该 SSH 链接中某个参数的布尔值无效：%@
zh_hant: SSH 連結中的參數包含無效的布林值：%@

# dialog.sshURL.error.invalidHostKeyPolicy
source: The SSH link included an invalid host key policy for parameter: %@
ar: تضمن رابط SSH سياسة مفتاح مضيف غير صالحة للمعلمة: %@
de: Der SSH-Link enthielt eine ungültige Hostkey-Richtlinie für den Parameter: %@
es: El enlace SSH incluía una política de clave de host no válida para el parámetro: %@
fr: Le lien SSH contient une politique de clé d'hôte non valide pour le paramètre : %@
ja: SSH リンクのパラメータに無効なホストキー確認ポリシーが含まれています: %@
ko: SSH 링크에 매개변수 %@에 대한 잘못된 호스트 키 정책이 포함되어 있습니다.
zh_hans: 该 SSH 链接中某个参数的主机密钥策略无效：%@
zh_hant: SSH 連結中的參數包含無效的主機金鑰原則：%@

# dialog.sshURL.error.invalidIntegerParameter
source: The SSH link included an invalid integer value for parameter: %@
ar: تضمن رابط SSH قيمة عدد صحيح غير صالحة للمعلمة: %@
de: Der SSH-Link enthielt einen ungültigen ganzzahligen Wert für den Parameter: %@
es: El enlace SSH incluía un valor entero no válido para el parámetro: %@
fr: Le lien SSH contient une valeur entière non valide pour le paramètre : %@
ja: SSH リンクのパラメータに無効な整数値が含まれています: %@
ko: SSH 링크에 매개변수 %@에 대한 잘못된 정수 값이 포함되어 있습니다.
zh_hans: 该 SSH 链接中某个参数的整数值无效：%@
zh_hant: SSH 連結中的參數包含無效的整數值：%@

# dialog.sshURL.error.invalidPort
source: The SSH port must be between 1 and 65535.
ar: يجب أن يكون منفذ SSH بين 1 و 65535.
de: Der SSH-Port muss zwischen 1 und 65535 liegen.
es: El puerto SSH debe estar entre 1 y 65535.
fr: Le port SSH doit être compris entre 1 et 65535.
ja: SSH ポートは 1 から 65535 の範囲で指定してください。
ko: SSH 포트는 1에서 65535 사이여야 합니다.
zh_hans: SSH 端口必须在 1 到 65535 之间。
zh_hant: SSH 連接埠必須介於 1 到 65535 之間。

# dialog.sshURL.error.missingDestination
source: The link did not include an SSH host.
ar: لم يتضمن الرابط مضيف SSH.
de: Der Link enthielt keinen SSH-Host.
es: El enlace no incluía un host SSH.
fr: Le lien ne contenait pas d’hôte SSH.
ja: リンクに SSH ホストが含まれていません。
ko: 링크에 SSH 호스트가 포함되어 있지 않습니다.
zh_hans: 该链接未包含 SSH 主机。
zh_hant: 該連結未包含 SSH 主機。

# dialog.sshURL.error.multipleLinks
source: Only one SSH link can be opened at a time.
ar: يمكن فتح رابط SSH واحد فقط في كل مرة.
de: Es kann nur jeweils ein SSH-Link geöffnet werden.
es: Solo se puede abrir un enlace SSH a la vez.
fr: Un seul lien SSH peut être ouvert à la fois.
ja: 一度に開ける SSH リンクは 1 つだけです。
ko: 한 번에 하나의 SSH 링크만 열 수 있습니다.
zh_hans: 一次只能打开一个 SSH 链接。
zh_hant: 一次只能開啟一個 SSH 連結。

# dialog.sshURL.error.titleContainsControlCharacters
source: The workspace title contains hidden control or formatting characters, so cmux refused to use it.
ar: يحتوي عنوان مساحة العمل على أحرف تحكم أو تنسيق مخفية، لذا رفض cmux استخدامه.
de: Der Titel des Arbeitsbereichs enthält versteckte Steuer- oder Formatierungszeichen, weshalb cmux die Verwendung verweigert hat.
es: El título del espacio de trabajo contiene caracteres ocultos de control o formato, por lo que cmux se negó a usarlo.
fr: Le titre de l’espace de travail contient des caractères de contrôle ou de formatage masqués, cmux a donc refusé de l’utiliser.
ja: ワークスペース名に隠れた制御文字または書式制御文字が含まれているため、cmux は使用を拒否しました。
ko: 작업 공간 제목에 숨겨진 제어 문자나 서식 문자가 포함되어 있어 cmux가 연결을 거부했습니다.
zh_hans: 工作区标题包含隐藏的控制字符或格式字符，因此 cmux 拒绝使用。
zh_hant: 工作區標題包含隱藏的控制或格式化字元，因此 cmux 拒絕使用。

# dialog.sshURL.error.titleTooLong
source: The workspace title is too long. The maximum length is %lld characters.
ar: عنوان مساحة العمل طويل جدًا. الحد الأقصى للطول هو %lld حرف.
de: Der Titel des Arbeitsbereichs ist zu lang. Die maximale Länge beträgt %lld Zeichen.
es: El título del espacio de trabajo es demasiado largo. La longitud máxima es de %lld caracteres.
fr: Le titre de l'espace de travail est trop long. La longueur maximale est de %lld caractères.
ja: ワークスペースのタイトルが長すぎます。最大長は%lld文字です。
ko: 작업 공간 제목이 너무 깁니다. 최대 길이는 %lld자입니다.
zh_hans: 工作区标题过长。最大长度为 %lld 个字符。
zh_hant: 工作區標題過長。最大長度為 %lld 個字元。

# dialog.sshURL.error.unsupportedParameter
source: The SSH link included an unsupported parameter: %@
ar: تضمن رابط SSH معلمة غير مدعومة: %@
de: Der SSH-Link enthielt einen nicht unterstützten Parameter: %@
es: El enlace SSH incluía un parámetro no admitido: %@
fr: Le lien SSH contient un paramètre non pris en charge : %@
ja: SSH リンクに未対応のパラメータが含まれています: %@
ko: SSH 링크에 지원되지 않는 매개변수가 포함되어 있습니다: %@
zh_hans: 该 SSH 链接包含不支持的参数：%@
zh_hant: SSH 連結包含不受支援的參數：%@

# dialog.sshURL.launchFailed.exit
source: cmux ssh exited with status %d.
ar: خرج cmux ssh بالحالة %d.
de: cmux ssh wurde mit Status %d beendet.
es: cmux ssh finalizó con el estado %d.
fr: cmux ssh s’est terminé avec le statut %d.
ja: cmux ssh はステータス %d で終了しました。
ko: cmux ssh가 상태 코드 %d(으)로 종료되었습니다.
zh_hans: cmux ssh 已退出，状态为 %d。
zh_hant: cmux ssh 已結束，狀態碼為 %d。
